; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v6)
		(pred_4 ?v2)
		(pred_3 ?v4)
		(pred_2 ?v4)
		(pred_5 ?v2 ?v4)
		(pred_1)
		(pred_6 ?v2))

   (:action op_3
       :parameters  (?v7 ?v8)
       :precondition (and (not-eq ?v7 ?v8) 
                          (pred_3 ?v7) (pred_3 ?v8) (pred_2 ?v7))
       :effect (and  (pred_2 ?v8)
		     (not (pred_2 ?v7))))


   (:action op_2
       :parameters (?v1 ?v5)
       :precondition  (and  (pred_4 ?v1) (pred_3 ?v5)
			    (pred_5 ?v1 ?v5) (pred_2 ?v5) (pred_1))
       :effect (and (pred_6 ?v1)
		    (not (pred_5 ?v1 ?v5)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v1  ?v5)
       :precondition  (and  (pred_4 ?v1) (pred_3 ?v5)
			    (pred_6 ?v1) (pred_2 ?v5))
       :effect (and (pred_5 ?v1 ?v5)
		    (pred_1)
		    (not (pred_6 ?v1)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_08 obj_09 obj_03 obj_01 obj_04 obj_02 
          obj_07 obj_06 obj_05 
)
(:init
(pred_3 obj_08)
(pred_3 obj_09)
(pred_3 obj_03)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_3 obj_02)
(pred_4 obj_07)
(pred_4 obj_06)
(pred_4 obj_05)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(pred_1)
(pred_5 obj_07 obj_02)
(pred_5 obj_06 obj_04)
(pred_5 obj_05 obj_08)
(pred_2 obj_09)
)
(:goal
(and
(pred_5 obj_07 obj_04)
(pred_5 obj_06 obj_02)
(pred_5 obj_05 obj_09)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_07 obj_04) (pred_2 obj_08))
    (sometime-before  (pred_5 obj_06 obj_02) (pred_2 obj_08))
    (sometime-before  (pred_5 obj_05 obj_09) (pred_2 obj_03))
  )
)
)

; plan
1. (op_3 obj_09 obj_08)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_08)
   goals met: 0 of 3
2. (op_2 obj_05 obj_08)
   deleted: (pred_5 obj_05 obj_08) (pred_1)
   added: (pred_6 obj_05)
   goals met: 0 of 3
3. (op_3 obj_08 obj_02)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_02)
   goals met: 0 of 3
4. (op_1 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_02) (pred_1)
   goals met: 0 of 3
5. (op_3 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 3
6. (op_2 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_1)
   added: (pred_6 obj_06)
   goals met: 0 of 3
7. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 0 of 3
8. (op_1 obj_06 obj_02)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_02) (pred_1)
   goals met: 1 of 3
9. (op_2 obj_05 obj_02)
   deleted: (pred_5 obj_05 obj_02) (pred_1)
   added: (pred_6 obj_05)
   goals met: 1 of 3
10. (op_3 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 1 of 3
11. (op_1 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_04) (pred_1)
   goals met: 1 of 3
12. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 1 of 3
13. (op_2 obj_07 obj_02)
   deleted: (pred_5 obj_07 obj_02) (pred_1)
   added: (pred_6 obj_07)
   goals met: 1 of 3
14. (op_3 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_03)
   goals met: 1 of 3
15. (op_1 obj_07 obj_03)
   deleted: (pred_6 obj_07)
   added: (pred_5 obj_07 obj_03) (pred_1)
   goals met: 1 of 3
16. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 1 of 3
17. (op_2 obj_05 obj_04)
   deleted: (pred_5 obj_05 obj_04) (pred_1)
   added: (pred_6 obj_05)
   goals met: 1 of 3
18. (op_3 obj_04 obj_09)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_09)
   goals met: 1 of 3
19. (op_1 obj_05 obj_09)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_09) (pred_1)
   goals met: 2 of 3
20. (op_3 obj_09 obj_03)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_03)
   goals met: 2 of 3
21. (op_2 obj_07 obj_03)
   deleted: (pred_5 obj_07 obj_03) (pred_1)
   added: (pred_6 obj_07)
   goals met: 2 of 3
22. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 2 of 3
23. (op_1 obj_07 obj_04)
   deleted: (pred_6 obj_07)
   added: (pred_5 obj_07 obj_04) (pred_1)
   goals met: 3 of 3
